artillery-tests/test-32.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 10 
scenarios:
  - flow:
      - loop:
          - post: # resource: resource32
              url: /send
              body: |
                {
                  "vp": {
                    "holder": "did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8",
                    "verifiableCredential": [
                        "{\"@context\":[\"https://www.w3.org/2018/credentials/v1\"],\"credentialSchema\":{\"id\":\"test-schema.org\",\"type\":\"JsonSchemaValidator2018\"},\"credentialSubject\":{\"attribute0\":\"value0\",\"attribute1\":\"value1\",\"attribute10\":\"value10\",\"attribute11\":\"value11\",\"attribute12\":\"value12\",\"attribute13\":\"value13\",\"attribute14\":\"value14\",\"attribute15\":\"value15\",\"attribute16\":\"value16\",\"attribute17\":\"value17\",\"attribute18\":\"value18\",\"attribute19\":\"value19\",\"attribute2\":\"value2\",\"attribute20\":\"value20\",\"attribute21\":\"value21\",\"attribute22\":\"value22\",\"attribute23\":\"value23\",\"attribute24\":\"value24\",\"attribute25\":\"value25\",\"attribute26\":\"value26\",\"attribute27\":\"value27\",\"attribute28\":\"value28\",\"attribute29\":\"value29\",\"attribute3\":\"value3\",\"attribute30\":\"value30\",\"attribute31\":\"value31\",\"attribute4\":\"value4\",\"attribute5\":\"value5\",\"attribute6\":\"value6\",\"attribute7\":\"value7\",\"attribute8\":\"value8\",\"attribute9\":\"value9\",\"id\":\"did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8\"},\"issuanceDate\":\"2023-12-06T13:45:18.521Z\",\"issuer\":\"did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8\",\"proof\":{\"created\":\"2023-12-06T13:45:18.521Z\",\"eip712\":{\"domain\":{\"chainId\":1,\"name\":\"VerifiableCredential\",\"version\":\"1\"},\"primaryType\":\"VerifiableCredential\",\"types\":{\"CredentialSchema\":[{\"name\":\"id\",\"type\":\"string\"},{\"name\":\"type\",\"type\":\"string\"}],\"CredentialSubject\":[{\"name\":\"attribute0\",\"type\":\"string\"},{\"name\":\"attribute1\",\"type\":\"string\"},{\"name\":\"attribute10\",\"type\":\"string\"},{\"name\":\"attribute11\",\"type\":\"string\"},{\"name\":\"attribute12\",\"type\":\"string\"},{\"name\":\"attribute13\",\"type\":\"string\"},{\"name\":\"attribute14\",\"type\":\"string\"},{\"name\":\"attribute15\",\"type\":\"string\"},{\"name\":\"attribute16\",\"type\":\"string\"},{\"name\":\"attribute17\",\"type\":\"string\"},{\"name\":\"attribute18\",\"type\":\"string\"},{\"name\":\"attribute19\",\"type\":\"string\"},{\"name\":\"attribute2\",\"type\":\"string\"},{\"name\":\"attribute20\",\"type\":\"string\"},{\"name\":\"attribute21\",\"type\":\"string\"},{\"name\":\"attribute22\",\"type\":\"string\"},{\"name\":\"attribute23\",\"type\":\"string\"},{\"name\":\"attribute24\",\"type\":\"string\"},{\"name\":\"attribute25\",\"type\":\"string\"},{\"name\":\"attribute26\",\"type\":\"string\"},{\"name\":\"attribute27\",\"type\":\"string\"},{\"name\":\"attribute28\",\"type\":\"string\"},{\"name\":\"attribute29\",\"type\":\"string\"},{\"name\":\"attribute3\",\"type\":\"string\"},{\"name\":\"attribute30\",\"type\":\"string\"},{\"name\":\"attribute31\",\"type\":\"string\"},{\"name\":\"attribute4\",\"type\":\"string\"},{\"name\":\"attribute5\",\"type\":\"string\"},{\"name\":\"attribute6\",\"type\":\"string\"},{\"name\":\"attribute7\",\"type\":\"string\"},{\"name\":\"attribute8\",\"type\":\"string\"},{\"name\":\"attribute9\",\"type\":\"string\"},{\"name\":\"id\",\"type\":\"string\"}],\"EIP712Domain\":[{\"name\":\"name\",\"type\":\"string\"},{\"name\":\"version\",\"type\":\"string\"},{\"name\":\"chainId\",\"type\":\"uint256\"}],\"Proof\":[{\"name\":\"created\",\"type\":\"string\"},{\"name\":\"proofPurpose\",\"type\":\"string\"},{\"name\":\"type\",\"type\":\"string\"},{\"name\":\"verificationMethod\",\"type\":\"string\"}],\"VerifiableCredential\":[{\"name\":\"@context\",\"type\":\"string[]\"},{\"name\":\"credentialSchema\",\"type\":\"CredentialSchema\"},{\"name\":\"credentialSubject\",\"type\":\"CredentialSubject\"},{\"name\":\"issuanceDate\",\"type\":\"string\"},{\"name\":\"issuer\",\"type\":\"string\"},{\"name\":\"proof\",\"type\":\"Proof\"},{\"name\":\"type\",\"type\":\"string[]\"}]}},\"proofPurpose\":\"assertionMethod\",\"proofValue\":\"0x58f8b98abc172031c8405d1d1c37f429380b958a3b2a72df4a188f4ad0fdfa294a926cbfccf5bd4a650fc2737a3499f730392a924eabc2496bfa953065e66b091c\",\"type\":\"EthereumEip712Signature2021\",\"verificationMethod\":\"did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8#controller\"},\"type\":[\"VerifiableCredential\",\"MascaUserCredential\"]}"
                    ],
                    "type": [
                        "VerifiablePresentation",
                        "Custom"
                    ],
                    "@context": [
                        "https://www.w3.org/2018/credentials/v1"
                    ],
                    "issuanceDate": "2023-12-06T13:45:54.736Z",
                    "proof": {
                        "verificationMethod": "did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8#controller",
                        "created": "2023-12-06T13:45:54.736Z",
                        "proofPurpose": "assertionMethod",
                        "type": "EthereumEip712Signature2021",
                        "proofValue": "0xae4b0e0a3db577c8b7b3f9b5ae9b6311d7cf62c05b03861e575f1688270eda35468310836da0a9f7a13543a7e7054bacd4aedf759c2332ed53386c6bb213c62a1c",
                        "eip712": {
                            "domain": {
                                "chainId": 1,
                                "name": "VerifiablePresentation",
                                "version": "1"
                            },
                            "types": {
                                "EIP712Domain": [
                                    {
                                        "name": "name",
                                        "type": "string"
                                    },
                                    {
                                        "name": "version",
                                        "type": "string"
                                    },
                                    {
                                        "name": "chainId",
                                        "type": "uint256"
                                    }
                                ],
                                "Proof": [
                                    {
                                        "name": "created",
                                        "type": "string"
                                    },
                                    {
                                        "name": "proofPurpose",
                                        "type": "string"
                                    },
                                    {
                                        "name": "type",
                                        "type": "string"
                                    },
                                    {
                                        "name": "verificationMethod",
                                        "type": "string"
                                    }
                                ],
                                "VerifiablePresentation": [
                                    {
                                        "name": "@context",
                                        "type": "string[]"
                                    },
                                    {
                                        "name": "holder",
                                        "type": "string"
                                    },
                                    {
                                        "name": "issuanceDate",
                                        "type": "string"
                                    },
                                    {
                                        "name": "proof",
                                        "type": "Proof"
                                    },
                                    {
                                        "name": "type",
                                        "type": "string[]"
                                    },
                                    {
                                        "name": "verifiableCredential",
                                        "type": "string[]"
                                    }
                                ]
                            },
                            "primaryType": "VerifiablePresentation"
                        }
                    }
                },
                  "resource": "resource32"
                }
              headers:
                content-type: application/json
        count: 1